#include <iostream>
#include <vector>
int main()
{
  std::vector<int> numbers;
  while (true)
  {
    std::cout << "-------------------------------------------\n"
              << "add: " << "値を追加します。" << "\n"
              << "remove: " << "値を削除します。" << "\n"
              << "update: " << "値を更新します。" << "\n"
              << "find: " << "値を検索します。" << "\n"
              << "sortAsc: " << "昇順に値をソートします。" << "\n"
              << "sortDesc: " << "降順に値をソートします。" << "\n"
              << "print: " << "値を出力します。" << "\n"
              << "exit: " << "アプリケーションの終了。" << "\n"
              << "-------------------------------------------\n";
  }

  return 0;
}